Sunil-Kumar-1706/STM_32/STM32_REG/07_UART/Drivers/Inc/USART_driver.h
#include "STM32476.h"

#ifndef INC_USART_DRIVER_H_
#define INC_USART_DRIVER_H_

typedef struct{
	uint8_t USART_Mode;
	uint32_t USART_Baud;
	uint8_t USART_NoOfStopBits;
	uint8_t USART_WordLength;
	uint8_t USART_ParityControl;
	uint8_t USART_HWFlowControl;
}USART_Config_t;


typedef struct
{
	USART_RegDef_t *pUSARTx;
	USART_Config_t   USART_Config;
	uint8_t *pTxBuffer;
	uint8_t *pRxBuffer;
	uint32_t TxLen;
	uint32_t RxLen;
	uint8_t TxBusyState;
	uint8_t RxBusyState;
}USART_Handle_t;

#define USART_MODE_ONLY_TX 			0
#define USART_MODE_ONLY_RX 			1
#define USART_MODE_TXRX  			2

#define USART_STD_BAUD_1200  		1200
#define USART_STD_BAUD_2400  		2400
#define USART_STD_BAUD_9600  		9600
#define USART_STD_BAUD_19200  		19200
#define USART_STD_BAUD_38400  		38400
#define USART_STD_BAUD_57600  		57600
#define USART_STD_BAUD_115200  		115200
#define USART_STD_BAUD_230400  		230400
#define USART_STD_BAUD_460800  		460800
#define USART_STD_BAUD_921600  		921600
#define USART_STD_BAUD_2M 			2000000
#define USART_STD_BAUD_3M			3000000


#define USART_PARITY_EN_ODD 		2
#define USART_PARITY_EN_EVEN 		1
#define USART_PARITY_DISABLE 		0

#define USART_WORDLEN_8BITS 		0
#define USART_WORDLEN_9BITS 		1

#define USART_STOPBITS_1     		0
#define USART_STOPBITS_0_5   		1
#define USART_STOPBITS_2     		2
#define USART_STOPBITS_1_5   		3

#define USART_HW_FLOW_CTRL_NONE    	0
#define USART_HW_FLOW_CTRL_CTS     	1
#define USART_HW_FLOW_CTRL_RTS     	2
#define USART_HW_FLOW_CTRL_CTS_RTS 	3

#define USART_FLAG_TXE 				( 1 << USART_ISR_TXE)
#define USART_FLAG_RXNE 			( 1 << USART_ISR_RXNE)
#define USART_FLAG_TC 				( 1 << USART_ISR_TC)


void USART_Init(USART_Handle_t *pUSARTHandle);

void USART_SendData(USART_Handle_t *pUSARTHandle, uint8_t *pTxBuffer, uint32_t Len);
void USART_ReceiveData(USART_Handle_t *pUSARTHandle, uint8_t *pRxBuffer, uint32_t Len);
uint8_t USART_SendDataIT(USART_Handle_t *pUSARTHandle,uint8_t*pTxBuffer,uint32_t Len);
uint8_t USART_ReceiveDataIT(USART_Handle_t *pUSARTHandle,uint8_t *pRxBuffer,uint32_t Len);

void  USART_IRQInterruptConfig(uint8_t IRQNumber,uint8_t EnorDi);
void USART_IRQPriorityConfig(uint8_t IRQNumber,uint32_t IRQPriority);
void USART_IRQHandling(USART_Handle_t *pHandle);

void USART_PeripheralControl(USART_RegDef_t *pUSARTx, uint8_t EnorDi);
uint8_t USART_GetFlagStatus(USART_RegDef_t *pUSARTx,uint8_t StatusFlagName_);
void USART_ClearFlag(USART_RegDef_t*pUSARTx,uint8_t StatusFlagName);



#endif /* INC_USART_DRIVER_H_ */
